; domain
(define (domain blocks)
  (:requirements :strips :typing)
  (:types block)

  (:predicates
    (on ?x - block ?y - block)
    (ontable ?x - block)
    (clear ?x - block)
    (holding ?x - block)
    (handempty)
  )

  ;; PICKUP(x): pick a clear block up from the table
  (:action pickup
    :parameters (?x - block)
    :precondition (and (ontable ?x) (clear ?x) (handempty))
    :effect (and
      (holding ?x)
      (not (ontable ?x))
      (not (clear ?x))
      (not (handempty))
    )
  )

  ;; PUTDOWN(x): put a held block down onto the table
  (:action putdown
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and
      (ontable ?x) (clear ?x) (handempty)
      (not (holding ?x))
    )
  )

  ;; UNSTACK(x, y): lift a clear block x off the top of y
  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and
      (holding ?x) (clear ?y)
      (not (on ?x ?y))
      (not (clear ?x))
      (not (handempty))
    )
  )

  ;; STACK(x, y): place a held block x onto a clear block y
  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and
      (on ?x ?y) (handempty) (clear ?x)
      (not (holding ?x))
      (not (clear ?y))
    )
  )
)

; problem
(define (problem BLOCKS-8-0)
(:domain BLOCKS)
(:objects H G F E C B D A - block)
(:INIT (CLEAR A) (CLEAR D) (CLEAR B) (CLEAR C) (ONTABLE E) (ONTABLE F)
 (ONTABLE B) (ONTABLE C) (ON A G) (ON G E) (ON D H) (ON H F) (HANDEMPTY))
(:goal (AND (ON D F) (ON F E) (ON E H) (ON H C) (ON C A) (ON A G) (ON G B)))
)

; plan
1. (unstack a g)
   deleted: (on a g) (clear a) (handempty)
   added: (holding a) (clear g)
   goals met: 0 of 7
2. (stack a c)
   deleted: (holding a) (clear c)
   added: (on a c) (handempty) (clear a)
   goals met: 0 of 7
3. (unstack g e)
   deleted: (on g e) (clear g) (handempty)
   added: (holding g) (clear e)
   goals met: 0 of 7
4. (stack g b)
   deleted: (holding g) (clear b)
   added: (on g b) (handempty) (clear g)
   goals met: 1 of 7
5. (unstack a c)
   deleted: (on a c) (clear a) (handempty)
   added: (holding a) (clear c)
   goals met: 1 of 7
6. (stack a g)
   deleted: (holding a) (clear g)
   added: (on a g) (handempty) (clear a)
   goals met: 2 of 7
7. (pickup c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 2 of 7
8. (stack c a)
   deleted: (holding c) (clear a)
   added: (on c a) (handempty) (clear c)
   goals met: 3 of 7
9. (unstack d h)
   deleted: (on d h) (clear d) (handempty)
   added: (holding d) (clear h)
   goals met: 3 of 7
10. (putdown d)
   deleted: (holding d)
   added: (ontable d) (clear d) (handempty)
   goals met: 3 of 7
11. (unstack h f)
   deleted: (on h f) (clear h) (handempty)
   added: (holding h) (clear f)
   goals met: 3 of 7
12. (stack h c)
   deleted: (holding h) (clear c)
   added: (on h c) (handempty) (clear h)
   goals met: 4 of 7
13. (pickup e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 4 of 7
14. (stack e h)
   deleted: (holding e) (clear h)
   added: (on e h) (handempty) (clear e)
   goals met: 5 of 7
15. (pickup f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 5 of 7
16. (stack f e)
   deleted: (holding f) (clear e)
   added: (on f e) (handempty) (clear f)
   goals met: 6 of 7
17. (pickup d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 6 of 7
18. (stack d f)
   deleted: (holding d) (clear f)
   added: (on d f) (handempty) (clear d)
   goals met: 7 of 7
